Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/atdf/PIC32CZ2051CA90144.atdf
      <value-group name="PHY00__RXPHSSEL">
        <value name="EARLIEST" caption="Earliest phase" value="0x0"/>
        <value name="LATEST" caption="Latest phase" value="0x7"/>
      </value-group>
    </module>
    <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="CONFIG__PER"/>
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="CONFIG__WINDOW"/>
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="EWCTRL__EWOFFSET"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby Synchronization Busy" mask="0x8"/>
          <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x10"/>
          <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x20"/>
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="PIC32CZCA144B" caption="PIC32CZCA144B">
      <pin position="A2" pad="PD11"/>
      <pin position="A3" pad="PD10"/>
      <pin position="A4" pad="PD07"/>
      <pin position="A5" pad="PD21"/>
      <pin position="A6" pad="PD04"/>
      <pin position="A7" pad="PD15"/>
      <pin position="A8" pad="PD02"/>
      <pin position="A9" pad="PD01"/>
      <pin position="A10" pad="PD00"/>
      <pin position="A11" pad="USBID0"/>
      <pin position="A12" pad="VCCA3P30"/>
      <pin position="A13" pad="VBUS0"/>
      <pin position="B1" pad="PA01"/>
      <pin position="B2" pad="PD12"/>
      <pin position="B3" pad="PD09"/>
      <pin position="B4" pad="PD08"/>
      <pin position="B5" pad="VDDREG"/>
      <pin position="B6" pad="PD17"/>
      <pin position="B7" pad="PD16"/>
      <pin position="B8" pad="PC17"/>
      <pin position="B9" pad="PD13"/>
      <pin position="B10" pad="RESET_N"/>
      <pin position="B11" pad="USBRBIAS0"/>
      <pin position="B12" pad="VSSUSBA"/>
      <pin position="B13" pad="USBDM0"/>
      <pin position="B14" pad="USBDP0"/>
      <pin position="C1" pad="PA02"/>
      <pin position="C2" pad="PA00"/>
      <pin position="C13" pad="PC14"/>
      <pin position="C14" pad="PC29"/>
      <pin position="D1" pad="PA03"/>
      <pin position="D2" pad="PA04"/>
      <pin position="D5" pad="PD06"/>
      <pin position="D6" pad="PD19"/>
      <pin position="D9" pad="PD03"/>
      <pin position="D10" pad="PD14"/>
      <pin position="D13" pad="VSSF"/>
      <pin position="D14" pad="VDDF"/>
      <pin position="E1" pad="PA05"/>
      <pin position="E2" pad="PA06"/>
      <pin position="E4" pad="PA22"/>
      <pin position="E5" pad="PD20"/>
      <pin position="E6" pad="PD05"/>
      <pin position="E7" pad="VDDIO"/>
      <pin position="E8" pad="PD18"/>
      <pin position="E9" pad="PC18"/>
      <pin position="E10" pad="VDDREG"/>
      <pin position="E11" pad="PC15"/>
      <pin position="E13" pad="PC20"/>
      <pin position="E14" pad="PC19"/>
      <pin position="F1" pad="PA08"/>
      <pin position="F2" pad="PA07"/>
      <pin position="F4" pad="PA23"/>
      <pin position="F5" pad="PA21"/>
      <pin position="F6" pad="VDDIO"/>
      <pin position="F7" pad="VSS"/>
      <pin position="F8" pad="VDDIO"/>
      <pin position="F9" pad="VSSREG"/>
      <pin position="F10" pad="PC13"/>
      <pin position="F11" pad="PC12"/>
      <pin position="F13" pad="PC27"/>
      <pin position="F14" pad="PC28"/>
      <pin position="G1" pad="PA25"/>
      <pin position="G2" pad="PA24"/>
      <pin position="G5" pad="VDDIO"/>
      <pin position="G6" pad="VSS"/>
      <pin position="G7" pad="VSS15"/>
      <pin position="G8" pad="VSS14"/>
      <pin position="G9" pad="VDDIO"/>
      <pin position="G10" pad="PC26"/>
      <pin position="G13" pad="PC10"/>
      <pin position="G14" pad="PC11"/>
      <pin position="H1" pad="PA10"/>
      <pin position="H2" pad="PA09"/>
      <pin position="H5" pad="PB03"/>
      <pin position="H6" pad="VDDIO"/>
      <pin position="H7" pad="VSSUSBD"/>
      <pin position="H8" pad="VSS"/>
      <pin position="H9" pad="VSSF"/>
      <pin position="H10" pad="VDDIO"/>
      <pin position="H13" pad="PC25"/>
      <pin position="H14" pad="PC09"/>
      <pin position="J1" pad="PA27"/>
      <pin position="J2" pad="PA26"/>
      <pin position="J4" pad="PB01"/>
      <pin position="J5" pad="PB18"/>
      <pin position="J6" pad="VSS"/>
      <pin position="J7" pad="VDDIO"/>
      <pin position="J8" pad="VSS"/>
      <pin position="J9" pad="VDDIO"/>
      <pin position="J10" pad="PC24"/>
      <pin position="J11" pad="PC23"/>
      <pin position="J13" pad="PC07"/>
      <pin position="J14" pad="PC06"/>
      <pin position="K1" pad="PA11"/>
      <pin position="K2" pad="PA12"/>
      <pin position="K4" pad="PB02"/>
      <pin position="K5" pad="PB19"/>
      <pin position="K6" pad="PB06"/>
      <pin position="K7" pad="VSS"/>
      <pin position="K8" pad="VDDIO"/>
      <pin position="K9" pad="PB09"/>
      <pin position="K10" pad="PC08"/>
      <pin position="K11" pad="PC22"/>
      <pin position="K13" pad="PC21"/>
      <pin position="K14" pad="PC05"/>
      <pin position="L1" pad="PA13"/>
      <pin position="L2" pad="PA14"/>
      <pin position="L5" pad="PB20"/>
      <pin position="L6" pad="PB21"/>
      <pin position="L9" pad="PB10"/>
      <pin position="L10" pad="PB11"/>
      <pin position="L13" pad="PC04"/>
      <pin position="L14" pad="PC02"/>
      <pin position="M1" pad="PA28"/>
      <pin position="M2" pad="PA29"/>
      <pin position="M13" pad="PC03"/>
      <pin position="M14" pad="PC01"/>
      <pin position="N1" pad="PA17"/>
      <pin position="N2" pad="PA18"/>
      <pin position="N3" pad="PA16"/>
      <pin position="N4" pad="PB00"/>
      <pin position="N5" pad="AVDD"/>
      <pin position="N6" pad="PB05"/>
      <pin position="N7" pad="PB23"/>
      <pin position="N8" pad="PB08"/>
      <pin position="N9" pad="VDDREG"/>
      <pin position="N10" pad="PB26"/>
      <pin position="N11" pad="PB13"/>
      <pin position="N12" pad="PB15"/>
      <pin position="N13" pad="PB17"/>
      <pin position="N14" pad="PC00"/>
      <pin position="P2" pad="PA20"/>
      <pin position="P3" pad="PA15"/>
      <pin position="P4" pad="PA19"/>
      <pin position="P5" pad="AVSS"/>
      <pin position="P6" pad="PB04"/>
      <pin position="P7" pad="PB22"/>
      <pin position="P8" pad="PB07"/>
      <pin position="P9" pad="PB24"/>
      <pin position="P10" pad="PB25"/>
      <pin position="P11" pad="PB12"/>
      <pin position="P12" pad="PB14"/>
      <pin position="P13" pad="PB16"/>
    </pinout>
    <pinout name="PIC32CZCA144DR" caption="PIC32CZCA144DR">
      <pin position="A1" pad="PA00"/>
      <pin position="A2" pad="PA02"/>
      <pin position="A3" pad="PA03"/>
      <pin position="A4" pad="GND"/>
      <pin position="A5" pad="PA05"/>
      <pin position="A6" pad="PA21"/>
      <pin position="A7" pad="PA23"/>
      <pin position="A8" pad="PA09"/>
      <pin position="A9" pad="PA25"/>
      <pin position="A10" pad="VDDIO"/>
      <pin position="A11" pad="PA11"/>
      <pin position="A12" pad="PA27"/>
      <pin position="A13" pad="PA12"/>
      <pin position="A14" pad="PA14"/>
      <pin position="A15" pad="PA29"/>
      <pin position="A16" pad="GND"/>
      <pin position="A17" pad="PA16"/>
      <pin position="A18" pad="PA18"/>
      <pin position="A19" pad="PA19"/>
      <pin position="A20" pad="PA20"/>
      <pin position="A21" pad="PB00"/>
      <pin position="A22" pad="PB02"/>
      <pin position="A23" pad="PB18"/>
      <pin position="A24" pad="PB20"/>
      <pin position="A25" pad="AVSS"/>
      <pin position="A26" pad="PB04"/>
      <pin position="A27" pad="VDDIO"/>
      <pin position="A28" pad="PB21"/>
      <pin position="A29" pad="PB22"/>
      <pin position="A30" pad="PB23"/>
      <pin position="A31" pad="PB08"/>
      <pin position="A32" pad="GND"/>
      <pin position="A33" pad="PB10"/>
      <pin position="A34" pad="PB24"/>
      <pin position="A35" pad="PB26"/>
      <pin position="A36" pad="VDDREG"/>
      <pin position="A37" pad="VDDIO"/>
      <pin position="A38" pad="PB13"/>
      <pin position="A39" pad="PB15"/>
      <pin position="A40" pad="PB17"/>
      <pin position="A41" pad="PC00"/>
      <pin position="A42" pad="PC02"/>
      <pin position="A43" pad="PC04"/>
      <pin position="A44" pad="VDDF"/>
      <pin position="A45" pad="PC05"/>
      <pin position="A46" pad="PC21"/>
      <pin position="A47" pad="PC07"/>
      <pin position="A48" pad="PC23"/>
      <pin position="A49" pad="PC09"/>
      <pin position="A50" pad="VDDIO"/>
      <pin position="A51" pad="PC26"/>
      <pin position="A52" pad="PC11"/>
      <pin position="A53" pad="PC28"/>
      <pin position="A54" pad="PC13"/>
      <pin position="A55" pad="PC14"/>
      <pin position="A56" pad="VDDF"/>
      <pin position="A57" pad="RESET_N"/>
      <pin position="A58" pad="PC18"/>
      <pin position="A59" pad="PC19"/>
      <pin position="A60" pad="PC20"/>
      <pin position="A61" pad="USBDM0"/>
      <pin position="A62" pad="USBDP0"/>
      <pin position="A63" pad="USBID0"/>
      <pin position="A64" pad="USBRBIAS0"/>
      <pin position="A65" pad="GND"/>
      <pin position="A66" pad="PD01"/>
      <pin position="A67" pad="PD14"/>
      <pin position="A68" pad="PD03"/>
      <pin position="A69" pad="VDDIO"/>
      <pin position="A70" pad="PD16"/>
      <pin position="A71" pad="PD04"/>
      <pin position="A72" pad="PD19"/>
      <pin position="A73" pad="PD05"/>
      <pin position="A74" pad="PD20"/>
      <pin position="A75" pad="PD07"/>
      <pin position="A76" pad="GND"/>
      <pin position="A77" pad="VDDIO"/>
      <pin position="A78" pad="PD09"/>
      <pin position="A79" pad="PD11"/>
      <pin position="A80" pad="PD12"/>
      <pin position="B1" pad="PA01"/>
      <pin position="B2" pad="PA04"/>
      <pin position="B3" pad="VDDIO"/>
      <pin position="B4" pad="PA06"/>
      <pin position="B5" pad="PA22"/>
      <pin position="B6" pad="PA07"/>
      <pin position="B7" pad="PA08"/>
      <pin position="B8" pad="PA24"/>
      <pin position="B9" pad="GND"/>
      <pin position="B10" pad="PA10"/>
      <pin position="B11" pad="PA26"/>
      <pin position="B12" pad="PA13"/>
      <pin position="B13" pad="PA28"/>
      <pin position="B14" pad="PA15"/>
      <pin position="B15" pad="VDDIO"/>
      <pin position="B16" pad="PA17"/>
      <pin position="B17" pad="PB01"/>
      <pin position="B18" pad="PB03"/>
      <pin position="B19" pad="PB19"/>
      <pin position="B20" pad="AVDD"/>
      <pin position="B21" pad="PB05"/>
      <pin position="B22" pad="GND"/>
      <pin position="B23" pad="PB06"/>
      <pin position="B24" pad="PB07"/>
      <pin position="B25" pad="VDDIO"/>
      <pin position="B26" pad="PB09"/>
      <pin position="B27" pad="PB11"/>
      <pin position="B28" pad="PB25"/>
      <pin position="B29" pad="PB12"/>
      <pin position="B30" pad="GND"/>
      <pin position="B31" pad="PB14"/>
      <pin position="B32" pad="PB16"/>
      <pin position="B33" pad="PC01"/>
      <pin position="B34" pad="PC03"/>
      <pin position="B35" pad="VSSF2"/>
      <pin position="B36" pad="PC06"/>
      <pin position="B37" pad="PC22"/>
      <pin position="B38" pad="PC08"/>
      <pin position="B39" pad="PC24"/>
      <pin position="B40" pad="PC25"/>
      <pin position="B41" pad="GND"/>
      <pin position="B42" pad="PC10"/>
      <pin position="B43" pad="PC27"/>
      <pin position="B44" pad="PC12"/>
      <pin position="B45" pad="PC29"/>
      <pin position="B46" pad="PC15"/>
      <pin position="B47" pad="VSSF1"/>
      <pin position="B48" pad="PC17"/>
      <pin position="B49" pad="VCCA3P30"/>
      <pin position="B50" pad="VSSUSBA"/>
      <pin position="B51" pad="VBUS0"/>
      <pin position="B52" pad="VDDREG"/>
      <pin position="B53" pad="PD00"/>
      <pin position="B54" pad="PD13"/>
      <pin position="B55" pad="PD02"/>
      <pin position="B56" pad="GND"/>
      <pin position="B57" pad="PD15"/>
      <pin position="B58" pad="PD17"/>
      <pin position="B59" pad="PD18"/>
      <pin position="B60" pad="PD06"/>
      <pin position="B61" pad="PD21"/>
      <pin position="B62" pad="VDDREG"/>
      <pin position="B63" pad="PD08"/>
      <pin position="B64" pad="PD10"/>
    </pinout>
    <pinout name="PIC32CZCA144" caption="PIC32CZCA144">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PA04"/>
      <pin position="6" pad="GND"/>
      <pin position="7" pad="VDDIO"/>
      <pin position="8" pad="PA05"/>
      <pin position="9" pad="PA06"/>
      <pin position="10" pad="PA21"/>
      <pin position="11" pad="PA22"/>
      <pin position="12" pad="PA23"/>
      <pin position="13" pad="PA07"/>
      <pin position="14" pad="PA08"/>
      <pin position="15" pad="PA09"/>
      <pin position="16" pad="PA24"/>
      <pin position="17" pad="PA25"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="VDDIO"/>
      <pin position="20" pad="PA10"/>
      <pin position="21" pad="PA11"/>
      <pin position="22" pad="PA26"/>
      <pin position="23" pad="PA27"/>
      <pin position="24" pad="PA12"/>
      <pin position="25" pad="PA13"/>
      <pin position="26" pad="PA14"/>
      <pin position="27" pad="PA28"/>
      <pin position="28" pad="PA29"/>
      <pin position="29" pad="PA15"/>
      <pin position="30" pad="GND"/>
      <pin position="31" pad="VDDIO"/>
      <pin position="32" pad="PA16"/>
      <pin position="33" pad="PA17"/>
      <pin position="34" pad="PA18"/>
      <pin position="35" pad="PA19"/>
      <pin position="36" pad="PA20"/>
      <pin position="37" pad="PB00"/>
      <pin position="38" pad="PB01"/>
      <pin position="39" pad="PB02"/>
      <pin position="40" pad="PB03"/>
      <pin position="41" pad="PB18"/>
      <pin position="42" pad="PB19"/>
      <pin position="43" pad="PB20"/>
      <pin position="44" pad="AVSS"/>
      <pin position="45" pad="AVDD"/>
      <pin position="46" pad="PB04"/>
      <pin position="47" pad="PB05"/>
      <pin position="48" pad="VDDIO"/>
      <pin position="49" pad="GND"/>
      <pin position="50" pad="PB21"/>
      <pin position="51" pad="PB06"/>
      <pin position="52" pad="PB22"/>
      <pin position="53" pad="PB23"/>
      <pin position="54" pad="PB07"/>
      <pin position="55" pad="PB08"/>
      <pin position="56" pad="VDDIO"/>
      <pin position="57" pad="GND"/>
      <pin position="58" pad="PB09"/>
      <pin position="59" pad="PB10"/>
      <pin position="60" pad="PB11"/>
      <pin position="61" pad="PB24"/>
      <pin position="62" pad="PB25"/>
      <pin position="63" pad="PB26"/>
      <pin position="64" pad="PB12"/>
      <pin position="65" pad="VDDREG"/>
      <pin position="66" pad="GND"/>
      <pin position="67" pad="VDDIO"/>
      <pin position="68" pad="PB13"/>
      <pin position="69" pad="PB14"/>
      <pin position="70" pad="PB15"/>
      <pin position="71" pad="PB16"/>
      <pin position="72" pad="PB17"/>
      <pin position="73" pad="PC00"/>
      <pin position="74" pad="PC01"/>
      <pin position="75" pad="PC02"/>
      <pin position="76" pad="PC03"/>
      <pin position="77" pad="PC04"/>
      <pin position="78" pad="VDDF"/>
      <pin position="79" pad="VSSF2"/>
      <pin position="80" pad="PC05"/>
      <pin position="81" pad="PC06"/>
      <pin position="82" pad="PC21"/>
      <pin position="83" pad="PC22"/>
      <pin position="84" pad="PC07"/>
      <pin position="85" pad="PC08"/>
      <pin position="86" pad="PC23"/>
      <pin position="87" pad="PC24"/>
      <pin position="88" pad="PC09"/>
      <pin position="89" pad="PC25"/>
      <pin position="90" pad="VDDIO"/>
      <pin position="91" pad="GND"/>
      <pin position="92" pad="PC26"/>
      <pin position="93" pad="PC10"/>
      <pin position="94" pad="PC11"/>
      <pin position="95" pad="PC27"/>
      <pin position="96" pad="PC28"/>
      <pin position="97" pad="PC12"/>
      <pin position="98" pad="PC13"/>
      <pin position="99" pad="PC29"/>
      <pin position="100" pad="PC14"/>
      <pin position="101" pad="PC15"/>
      <pin position="102" pad="VDDF"/>
      <pin position="103" pad="VSSF1"/>
      <pin position="104" pad="RESET_N"/>
      <pin position="105" pad="PC17"/>
      <pin position="106" pad="PC18"/>
      <pin position="107" pad="PC19"/>
      <pin position="108" pad="PC20"/>
      <pin position="109" pad="USBDM0"/>
      <pin position="110" pad="USBDP0"/>
      <pin position="111" pad="USBID0"/>
      <pin position="112" pad="VCCA3P30"/>
      <pin position="113" pad="VSSUSBA"/>
      <pin position="114" pad="VBUS0"/>
      <pin position="115" pad="USBRBIAS0"/>
      <pin position="116" pad="GND"/>
      <pin position="117" pad="VDDREG"/>
      <pin position="118" pad="PD00"/>
      <pin position="119" pad="PD01"/>
      <pin position="120" pad="PD13"/>
      <pin position="121" pad="PD14"/>
      <pin position="122" pad="PD02"/>
      <pin position="123" pad="PD03"/>
      <pin position="124" pad="GND"/>
      <pin position="125" pad="VDDIO"/>
      <pin position="126" pad="PD15"/>
      <pin position="127" pad="PD16"/>
      <pin position="128" pad="PD17"/>
      <pin position="129" pad="PD04"/>
      <pin position="130" pad="PD18"/>
      <pin position="131" pad="PD19"/>
      <pin position="132" pad="PD05"/>
      <pin position="133" pad="PD06"/>
      <pin position="134" pad="PD20"/>
      <pin position="135" pad="PD21"/>
      <pin position="136" pad="PD07"/>
      <pin position="137" pad="VDDREG"/>
      <pin position="138" pad="GND"/>
      <pin position="139" pad="VDDIO"/>
      <pin position="140" pad="PD08"/>
      <pin position="141" pad="PD09"/>
      <pin position="142" pad="PD10"/>
      <pin position="143" pad="PD11"/>
      <pin position="144" pad="PD12"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
